---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.ImportFailures.ElementRenamedOnImport
source: html/e49bd060-0b15-6311-fbea-2e50b9d09e34.htm
---
# Autodesk.Revit.DB.BuiltInFailures.ImportFailures.ElementRenamedOnImport Property

There were duplicate names between the active model and the imported element. To avoid duplicate names, the imported element has been renamed.

## Syntax (C#)
```csharp
public static FailureDefinitionId ElementRenamedOnImport { get; }
```